Revit 2024 API
OverrideGraphicSettings.IsSurfaceForegroundPatternVisible Property
 The visibility of the surface foreground fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public bool IsSurfaceForegroundPatternVisible { get; }
Visual Basic
Public ReadOnly Property IsSurfaceForegroundPatternVisible As Boolean
	Get
Visual C++
public:
property bool IsSurfaceForegroundPatternVisible {
	bool get ();
}
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace